chore: replace dot graph with mermaid
dot graph가 readme에서 렌더링이 안되므로 mermaid 형식으로 교체
